> # convert_dtypes
> ---

In [1]:
import pandas as pd

In [2]:
nome   = pd.Series(['João','Maria','Letícia','Roberto','Joaquim'])
altura = pd.Series([1.80, 1.79, 1.76, 1.81, 1.75], dtype='object')
idade = pd.Series([29, 24, 30, 20, 50], dtype='object')
matriculado = pd.Series([True, True, False, True, False], dtype='object')

df = pd.DataFrame({
    'nome':nome,
    'altura':altura,
    'idade':idade,
    'matriculado':matriculado
})

In [3]:
df.head()

      nome altura idade matriculado
0     João    1.8    29        True
1    Maria   1.79    24        True
2  Letícia   1.76    30       False
3  Roberto   1.81    20        True
4  Joaquim   1.75    50       False

In [4]:
df.dtypes

nome           object
altura         object
idade          object
matriculado    object
dtype: object

In [5]:
novo_df = df.convert_dtypes(convert_boolean=False)

In [6]:
novo_df.head()

      nome  altura  idade  matriculado
0     João    1.80     29            1
1    Maria    1.79     24            1
2  Letícia    1.76     30            0
3  Roberto    1.81     20            1
4  Joaquim    1.75     50            0

In [7]:
novo_df.dtypes

nome            string
altura         float64
idade            Int64
matriculado      Int64
dtype: object